app/Http/Middleware/UpdateOnlineStatus.php

update `users` set `users`.`updated_at` = '2023-11-29 00:29:14' where `id` = 1
---
    public function handle(Request $request, Closure $next)
    {
        if (Auth::check() && (strtotime(Auth::user()->updated_at) + 150) < time()) {
            $user = Auth::user();
            $user->updated_at = Carbon::now()->toDateTimeString();
            $user->save();