app/Http/Controllers/Endpoints/ItemApiController.php

select * from `items` order by `updated_at` asc
select * from `items` where `item_type` = 'Hat' order by `updated_at` asc
---
        function getEventItems($eventId)
        {
            // Add return statement to get the query result
            return Item::where(['in_event' => true, 'event_id' => $eventId])->get();
        }

        if ($category === 'Recent') {
            // Get all items sorted by updated_at
            $items = Item::orderBy('updated_at')->get();
        } elseif ($category === 'event') {
            // Get items where 'in_event' is true
            $eventItems = Item::where('in_event', true)->get();

            $eventItemsArray = [];
            foreach ($eventItems as $item) {
                // Call the getEventItems function to get event items for each event_id
                $eventItemsArray[] = getEventItems($item->event_id);
            }

            // Merge the arrays of event items into a single array
            $items = collect($eventItemsArray)->flatten();
        } else {
            // Get items with a specific item_type sorted by updated_at
            $items = Item::where('item_type', $category)->orderBy('updated_at')->get();