app/Http/Controllers/Endpoints/RenderController.php

select * from `user_avatars` where `user_avatars`.`id` = 1 limit 1
update `user_avatars` set `image` = '7e042e2ac67c6e5057ab71bc02a0c82e24b04eb007f3' where `id` = 1
---
    public function UserRender(Request $request, $id)
    {
        // Retrieve parameters for the request
        $user = Avatar::findOrFail($id);

        // Verify the encryption or any other required validations
        $avatar_thumbnail_name = bin2hex(random_bytes(22));
        $requestData = $this->prepareRequestData($user, $avatar_thumbnail_name);

        // Make HTTP request to the rendering server
        $this->makeRenderRequest($requestData);

        // Retrieve the rendered image path
        $imagePath = config('Values.storage.url') . '/thumbnails/' . $avatar_thumbnail_name . '.png';

        // Read the rendered image file
        $imageData = file_get_contents($imagePath);

        // Update the user's image and save
        $user->image = $avatar_thumbnail_name;
        $user->save();

select * from `user_avatars` where `user_avatars`.`id` = 1 limit 1
---
    public function getRenderHash($id)
    {
        $user = Avatar::findOrFail($id);