app/Http/Controllers/Endpoints/UserController.php

    public function getStatus($userID)
    {
        $user = User::where('id', '=', $userID)->first();
---
select * from `users` where `id` = '1' limit 1