app/Http/Controllers/GrabController.php

select count(*) as aggregate from `users`
---
    public function WelcomeIndex()
    {
        // Define a cache key for this query result
        $cacheKey = 'welcome_user_count';

        // Use caching to store the user count query result
        $userCount = cache()->remember($cacheKey, now()->addHours(1), function () {
            return (int) User::count();

select * from `users` where `username` = 'Aeo' limit 1
---
    public function ProfileIndex($username)
    {
        // Define a unique cache key for this user's profile
        $cacheKey = 'user_profile_' . $username;

        // Retrieve the user profile from the cache, if available
        $user = Cache::remember($cacheKey, now()->addMinutes(60), function () use ($username) {
            // Retrieve the user by username
            return User::where('username', $username)->first();

select `users`.*, `followers`.`following_id` as `pivot_following_id`, `followers`.`follower_id` as `pivot_follower_id` from `users` inner join `followers` on `users`.`id` = `followers`.`follower_id` where `followers`.`following_id` = 1
---
        // Format join date
        $joindate = Carbon::parse($user->created_at)->format('M d Y');

        $response = inertia('Users/Profile', [
            'user' => $user,
            'user.avatar' => $user->thumbnail(),
            'user.followsYou' => $isFollowing,
            'joindate' => $joindate,
            'user.followers_count' => $user->followers_count,
            'user.following_count' => $user->following_count,
            'user.following' => $user->following()->get(),
            'is_following' => $thisFollowing,
            'user.followers' => $user->followers()->get(),
            'user.posts' => $user->posts_count,
            'user.settings' =>  $user->settings,
        ]);

select * from `items` where `id` = '1' limit 1
select * from `items` where (`id` != 1 and `public_view` = 1 and `status` = 'approved' and `creator_id` = 1) order by RAND() limit 6
---
    public function storeItem($id)
    {
        // Define cache keys
        $cacheKey = 'store_item_' . $id;
        $recommendationCacheKey = 'recommendation_' . $id;

        // Retrieve item data with caching
        $item = cache()->remember($cacheKey, now()->addHours(6), function () use ($id) {
            return Item::where('id', $id)->first();
        });

        if (!$item) {
            abort(404);
        }

        // Retrieve recommendations with caching
        $recommendations = cache()->remember($recommendationCacheKey, now()->addHours(6), function () use ($item) {
            return Item::where([
                ['id', '!=', $item->id],
                ['public_view', true],
                ['status', 'approved'],
                ['creator_id', $item->creator->id]
            ])->inRandomOrder()->take(6)->get();

update `user_avatars` set `color_right_arm` = 'f5cd30' where `id` = 1
---

                // Update the avatar's color for the specified body part
                $avatar->{"color_{$request->body_part}"} = $request->color;
                $avatar->save();

select * from `forum_topics` where (`section_id` = 1) order by `id` asc
select * from `forum_topics` where (`section_id` = 2) order by `id` asc
select * from `forum_topics` where (`section_id` = 3) order by `id` asc
select * from `forum_topics` where `id` = '1' limit 1
---
    public function ForumIndex($id)
    {
        // Define the sections
        $sectionFilters = [
            1 => ['section_id' => 1],
            2 => ['section_id' => 2],
            3 => ['section_id' => 3],
        ];

        // Apply staff-only view filters if the user is a staff member
        $isStaff = Auth::check() && Auth::user()->isStaff() == 1;
        if ($isStaff) {
            $sectionFilters[1]['is_staff_only_viewing'] = false;
            $sectionFilters[2]['hidden'] = false;
            $sectionFilters[3]['is_staff_only_viewing'] = false;
        }

        // Use caching to store the forum topics for each section
        $sectionOneTopics = cache()->remember('section_one_topics', now()->addMinutes(30), function () use ($sectionFilters) {
            return ForumTopic::where($sectionFilters[1])->orderBy('id', 'asc')->get();
        });

        $sectionTwoTopics = cache()->remember('section_two_topics', now()->addMinutes(30), function () use ($sectionFilters) {
            return ForumTopic::where($sectionFilters[2])->orderBy('id', 'asc')->get();
        });

        $sectionThreeTopics = cache()->remember('section_three_topics', now()->addMinutes(30), function () use ($sectionFilters) {
            return ForumTopic::where($sectionFilters[3])->orderBy('id', 'asc')->get();
        });

        // Fetch the selected forum topic
        $topic = ForumTopic::where('id', '=', $id)->firstOrFail();