app/Models/Item.php

    public function owners()
    {
        return Inventory::where([
            ['item_id', '=', $this->id]
        ])->count();
---
select count(*) as aggregate from `inventories` where (`item_id` = 1)