app/Models/User.php

    public function avatar()
    {
        return Avatar::where('user_id', '=', $this->id)->first();
---
select * from `user_avatars` where `user_id` = 1 limit 1

    public function ownsItem($id)
    {
        return Inventory::where([
            ['user_id', '=', $this->id],
            ['item_id', '=', $id]
        ])->exists();
---
select exists(select * from `inventories` where (`user_id` = 1 and `item_id` = 1)) as `exists`

    public function isStaff()
    {
        return Admin::where([
            ['user_id', '=', $this->id],
        ])->exists();
---
select exists(select * from `admins` where (`user_id` = 1)) as `exists`